//! 난이도 : Lv.1

//^20221231
// 001. 평균 구하기 
// 002. 짝수와 홀수
// 003. 자릿수 더하기
// 004. 약수의 합
// 005. 자연수 뒤집어 배열로 만들기
// 006. 문자열 내 p와 y의 개수
// 007. x만큼 간격이 있는 n개의 숫자
// 008. 문자열을 정수로 바꾸기
// 009. 하샤드 수
// 010. 정수 제곱근 판별
// 011. 정수 내림차순으로 배치하기
// 012. 두 정수 사이의 합
// 013. 콜라츠 추측
// 014. 나머지가 1이 되는 수 찾기 //20230105
// 015. 콜라츠 추측
// 016. 서울에서 김서방 찾기
// 017. 핸드폰 번호 가리기
// 018. 나누어 떨어지는 숫자 배열
// 019. 제일 작은 수 제거하기
// 020. 수박수박수박수박수박수?
// 021. 가운데 글자 가져오기

//^20230101
// 022. 부족한 금액 계산하기
// 023. 문자열 다루기 기본

//^20230104
// 024. 직사각형 별찍기
// 025. 문자열 내림차순으로 배치하기
// 026. 같은 숫자는 싫어

//^20230105
// 014. 나머지가 1이 되는 수 찾기 
// 027. 없는 숫자 더하기
// 028. 내적

//^20230106
// 029. 3진법 뒤집기

//^20230122
// 030. 약수의 개수와 덧셈 //tip 제곱근이 정수면 약수의 개수가 홀수다.. isInteger(Math.sqrt(i))

//^20230123
// 031. 음양 더하기






//~ 좀 더 익숙해져야할 함수
// split('').reduce((acc, curr) => acc + parseInt(curr), 0)
// repeat("*")
// return a.reduce((acc, _, i) => acc += a[i] * b[i], 0);내적 // reduce에 3번째 인자는 인덱스로 활용할 수 있다.


//& 참고사항
// 문자에 * / 연산을 하면 쉽게 숫자형으로 형변환되어 반환한다.
// substring()은 모두 lowercase 이다.
//window sourcetree git test
//holiday
//holiday
//holiday
//covid..
//covid..
//covid
//covid 